tools/backOfficeProvisioning/templates/getAllAcctServAndRefTemplate.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:v3="http://www.viasat.com/XMLSchema/PublicWebService/AccountInfo/v3">
   <soapenv:Header><wsse:Security soapenv:mustUnderstand="1" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"><wsu:Timestamp wsu:Id="TS-3605AB1B1237B539B615548484154844"><wsu:Created>2019-04-09T22:20:15Z</wsu:Created><wsu:Expires>2019-04-09T22:25:15Z</wsu:Expires></wsu:Timestamp><wsse:UsernameToken wsu:Id="UsernameToken-3605AB1B1237B539B615548484154833"><wsse:Username>bepe2e_testapiqa</wsse:Username><wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText">dOneJL4A5i</wsse:Password><wsse:Nonce EncodingType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-soap-message-security-1.0#Base64Binary">g1b7OlPzavwF3WyJYxECzQ==</wsse:Nonce><wsu:Created>2019-04-09T22:20:15.482Z</wsu:Created></wsse:UsernameToken></wsse:Security></soapenv:Header>
   <soapenv:Body>
      <v3:getAllAccountServicesAndReferences>
         <v3:externalSubscriberIdentifier>
            <externalSystemName>WB_DIRECT</externalSystemName>
            <externalReference>BEPE2E1553117886</externalReference>
         </v3:externalSubscriberIdentifier>
      </v3:getAllAccountServicesAndReferences>
   </soapenv:Body>
</soapenv:Envelope>